
#  Notebook “Day 9 – Pandas basics (Series & dataframes) -
#using dictionary & list-

 # Series:-

In [2]:
import pandas as pd   #importing pandas- ('pd') means name we can use it as nickname it is known as Alias.

In [11]:
#Mys_1st_pandas-code-
#As a list-

lst=[12,45,43,36]
var=pd.Series(lst)
print(var)

0    12
1    45
2    43
3    36
dtype: int64

In [50]:
#As a Dictionary

dict={'Name':'Prince','Course':'Bca','Goal':'Data Science','Roll no':231205}
var2=pd.Series(dict)
print(var2)
print(type(var2))   #type

#when int+string then show the type is 'object'.

Name             Prince
Course              Bca
Goal       Data Science
Roll no          231205
dtype: object
<class 'pandas.core.series.Series'>

In [48]:
#As a Dictionary & accessing-

marks=pd.Series([92,65,888,456,433,45])
print(x)
print(type(x))  #type 
print(x[5])  #Accessing inedex no.5
print(x[3])  #Accessing inedex no.3

0     92
1     65
2    888
3    456
4    433
5     45
dtype: int64
<class 'pandas.core.series.Series'>
45
456

In [13]:
#changing index or serial no.-

num1=[2334,9098,4598,872,643,3009,5467,3349]
var=pd.Series(num1,index=['a','b','c','d','e','f','g','h'])
print(var)

print()

num2=[378766,99807,45664,34567]
p=pd.Series(num2,index=[5,6,7,8])
print(p)

a    2334
b    9098
c    4598
d     872
e     643
f    3009
g    5467
h    3349
dtype: int64

5    378766
6     99807
7     45664
8     34567
dtype: int64

In [47]:
#changing type (int-float)-

num3=[2000,2500,3000,6500,5487,5460]
var2=pd.Series(num3,dtype="float")
print(var2)
print(type(var2))

print()

#float to int->
# num4=[456.3,345.98,762.5,8989.6,7658.76]
# var3=pd.Series(num4,dtype="int")  -----> not Performing
# print(var3)
# print(type(var3))   ---> Error

num5=[456.3,345.98,762.5,8989.6,7658.76]
var4=pd.Series(num5)
print(var4)
print(type(var4))

print()

float_to_int=var4.astype(int)
print(float_to_int)

print(type(float_to_int))

0    2000.0
1    2500.0
2    3000.0
3    6500.0
4    5487.0
5    5460.0
dtype: float64
<class 'pandas.core.series.Series'>

0     456.30
1     345.98
2     762.50
3    8989.60
4    7658.76
dtype: float64
<class 'pandas.core.series.Series'>

0     456
1     345
2     762
3    8989
4    7658
dtype: int64
<class 'pandas.core.series.Series'>

In [67]:
#addition of two operations:-

x1=pd.Series([345,655,99,87,348,129])
x2=pd.Series([43,546,78,43,987,345,34,567])
result=(x1+x2)
print(result)        #it also perform addition operation when numer is missing but gives NAN (but in numpy gives broadcasting error).
print(type(result))
print()

#using range() function

y1=pd.Series(range(1,13))
y2=pd.Series(range(5,13))

print("The addition of y1 and y2:",y1+y2)  #sum of y1 & y2

0     388.0
1    1201.0
2     177.0
3     130.0
4    1335.0
5     474.0
6       NaN
7       NaN
dtype: float64
<class 'pandas.core.series.Series'>

The addition of y1 and y2: 0      6.0
1      8.0
2     10.0
3     12.0
4     14.0
5     16.0
6     18.0
7     20.0
8      NaN
9      NaN
10     NaN
11     NaN
dtype: float64

# DataFrame:-

In [68]:
import pandas as pd

In [19]:
#As a list-

lst=[23,45,65,43,45]  #as a list
var=pd.DataFrame(lst)
print(var)  
print(type(var))  #type of operation
var.head(3)  #it show the first operation (entered or dafualt 5)

    0
0  23
1  45
2  65
3  43
4  45
<class 'pandas.core.frame.DataFrame'>

    0
0  23
1  45
2  65

In [75]:
#As a Dictionary-

dict={"Names":["prince","Hritik"],"Age":[20,22]}
var2=pd.DataFrame(dict)
print(var2)
print(type(var2))  #type

    Names  Age
0  prince   20
1  Hritik   22
<class 'pandas.core.frame.DataFrame'>

In [80]:
#As a dictionary we can perform the operation only (column) example-

dict={"Names":["prince","Hritik"],"Age":[20,22],"Weight":[70,73]}  #add weight for explaination
var2=pd.DataFrame(dict,columns=["Weight"])   #only column
print(var2)
print(type(var2))
print(var2.size)  #size of operation

   Weight
0      70
1      73
<class 'pandas.core.frame.DataFrame'>
2

In [87]:
#Accessing the value:-
data = {'Subject':['Math','Science','History'],'Marks': [88,92,79]}
df = pd.DataFrame(data)
print(df)
print()

print(df['Subject'][2])   #Accessing the no.2 index of Subject
print(df['Subject'][1])   #Accessing the no.1 index of Subject
print(df['Marks'][2])     #Accessing the no.2 index of Marks
print(df['Subject'][0])   #Accessing the no.0 index of Subject

   Subject  Marks
0     Math     88
1  Science     92
2  History     79

History
Science
79
Math

In [94]:
#List inside a list:-

lst=[[24,45,65,45,32,16,95],[67,45,65,78,86,87,54],[65,99,81,87,22,18,87]]
lst=pd.DataFrame(lst)
print(lst)
print(lst.ndim)   #checking dimension
print(lst.size)   #checking size
print(type(lst))  #checking type

    0   1   2   3   4   5   6
0  24  45  65  45  32  16  95
1  67  45  65  78  86  87  54
2  65  99  81  87  22  18  87
2
21
<class 'pandas.core.frame.DataFrame'>

In [97]:
#we can perform DataFrame as dictionary of Series-

sr={'s':pd.Series([1,2,3,4]),'r':pd.Series([1,2,3,4])}   #Series of 's' & 'r' as dictionary in sr variable.
psr=pd.DataFrame(sr)   #converting to Dataframe.
print(psr)

   s  r
0  1  1
1  2  2
2  3  3
3  4  4

In [109]:
#Arthmetic operations on DataFrame
var=pd.DataFrame({'A':[13,25,53],'B':[32,24,17],'C':[23,41,19]})
print(var)
print()

#Addition-
print("Addition")
var["D"]=var['A']+var['B']+var['C']  #for addition
print(var)
print()

#Subtration
print("Subtraction")
var["D"]=var['A']-var['B']-var['C']   #for subtraction
print(var)

#Division
print("Division")
var["D"]=var['A']/var['B']/var['C']  #for division
print(var)

#Multiplication
print("Multiplication")
var["D"]=var['A']*var['B']*var['C']
print(var)

    A   B   C
0  13  32  23
1  25  24  41
2  53  17  19

Addition
    A   B   C   D
0  13  32  23  68
1  25  24  41  90
2  53  17  19  89

Subtraction
    A   B   C   D
0  13  32  23 -42
1  25  24  41 -40
2  53  17  19  17
Division
    A   B   C         D
0  13  32  23  0.017663
1  25  24  41  0.025407
2  53  17  19  0.164087
Multiplication
    A   B   C      D
0  13  32  23   9568
1  25  24  41  24600
2  53  17  19  17119

In [119]:
#Greater or less check in DataFrame:-
var=pd.DataFrame({'A':[13,25,53],'B':[32,24,17],'C':[23,41,19]})

#Graeter
var['Greater than 20 in B']=var['B']>20
print(var)

print("______________________________________________________________________________-")

#Less
var["less than 20 in A than 20 in A"]=var['A']<=20
print(var)

    A   B   C  Greater than 20 in B
0  13  32  23                  True
1  25  24  41                  True
2  53  17  19                 False
______________________________________________________________________________-
    A   B   C  Greater than 20 in B  less than 20 in A than 20 in A
0  13  32  23                  True                            True
1  25  24  41                  True                           False
2  53  17  19                 False                           False

In [16]:
#Converting customers csv into dataframe:- 
#CSV of Customers:-

Data={"Customer_ID":[1,2,3,4,5,6],
      "Name":['Prince','Hritik','Rencho','Gaurav','Gautam','Saurav'],
      "Age":[19,20,22,21,23,19],
      "city":['Delhi','Agra','Hyderabad','Jaipur','kanpur','Jodhpur']}

customer_data=pd.DataFrame(Data)
print(customer_data)

customer_data.describe()  #describe function (show- count,mean,std,min,max,etc)

   Customer_ID    Name  Age       city
0            1  Prince   19      Delhi
1            2  Hritik   20       Agra
2            3  Rencho   22  Hyderabad
3            4  Gaurav   21     Jaipur
4            5  Gautam   23     kanpur
5            6  Saurav   19    Jodhpur

       Customer_ID        Age
count     6.000000   6.000000
mean      3.500000  20.666667
std       1.870829   1.632993
min       1.000000  19.000000
25%       2.250000  19.250000
50%       3.500000  20.500000
75%       4.750000  21.750000
max       6.000000  23.000000

In [23]:
# practice question:-
# Write code using loc to select all rows where Department is "IT" and Salary is greater than 75000.-


data={'EmployeeID':[101,102,103,104,105],'Department':['HR','IT','Finance','IT','HR'],'Salary':[50000,70000,65000,80000,55000]}
df=pd.DataFrame(data)
df

   EmployeeID Department  Salary
0         101         HR   50000
1         102         IT   70000
2         103    Finance   65000
3         104         IT   80000
4         105         HR   55000

In [24]:
condition=(df['Department']=='IT') & (df['Salary']>75000)
result=df.loc[condition]  #loc function (used to filter rows and columns).
result

   EmployeeID Department  Salary
3         104         IT   80000